internal/cli/testdata/golden/k8s-web-ts/architecture.mmd
%% Architecture of k8s-web-ts, generated by cloudcc.
flowchart LR
    aws_ecr_web["web\necr"]
    aws_eks_cluster_kubernetes["kubernetes\neks.cluster"]
    aws_eks_clusterrole_kubernetes["kubernetes\neks.clusterrole"]
    aws_eks_nodegroup_kubernetes["kubernetes\neks.nodegroup"]
    aws_eks_noderole_kubernetes["kubernetes\neks.noderole"]
    aws_vpc_gateway_network["network\nvpc.gateway"]
    aws_vpc_routeassoc_network_0["network-0\nvpc.routeassoc"]
    aws_vpc_routeassoc_network_1["network-1\nvpc.routeassoc"]
    aws_vpc_routetable_network["network\nvpc.routetable"]
    aws_vpc_securitygroup_network["network\nvpc.securitygroup"]
    aws_vpc_subnet_network_0["network-0\nvpc.subnet"]
    aws_vpc_subnet_network_1["network-1\nvpc.subnet"]
    aws_vpc_network["network\nvpc"]
    k8s_deployment_web["web\nk8s.deployment"]
    k8s_provider_kubernetes["kubernetes\nk8s.provider"]
    k8s_service_web["web\nk8s.service"]
    aws_eks_cluster_kubernetes --> aws_eks_clusterrole_kubernetes
    aws_eks_cluster_kubernetes --> aws_vpc_subnet_network_0
    aws_eks_cluster_kubernetes --> aws_vpc_subnet_network_1
    aws_eks_nodegroup_kubernetes --> aws_eks_cluster_kubernetes
    aws_eks_nodegroup_kubernetes --> aws_eks_noderole_kubernetes
    aws_eks_nodegroup_kubernetes --> aws_vpc_subnet_network_0
    aws_eks_nodegroup_kubernetes --> aws_vpc_subnet_network_1
    aws_vpc_gateway_network --> aws_vpc_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_subnet_network_0
    aws_vpc_routeassoc_network_1 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_1 --> aws_vpc_subnet_network_1
    aws_vpc_routetable_network --> aws_vpc_gateway_network
    aws_vpc_routetable_network --> aws_vpc_network
    aws_vpc_securitygroup_network --> aws_vpc_network
    aws_vpc_subnet_network_0 --> aws_vpc_network
    aws_vpc_subnet_network_1 --> aws_vpc_network
    k8s_deployment_web --> aws_ecr_web
    k8s_deployment_web --> k8s_provider_kubernetes
    k8s_provider_kubernetes --> aws_eks_cluster_kubernetes
    k8s_provider_kubernetes --> aws_eks_nodegroup_kubernetes
    k8s_service_web --> k8s_deployment_web
